{
  "main-title": "Neural Numbers",
  "nav-button-intro": "Can I read your number?",
  "nav-button-training": "Train the Network!",
  "nav-button-how-does-it-work": "How does it work?",
  "nav-button-design-network": "Design the network!",
  "ui-label-input-placeholder": "write a number between 0&nbsp;and&nbsp;9",
  "ui-label-output-normalized": "Normalized Image",
  "intro-title": "Can I read your number?",
  "training-title-train": "Train the Network!",
  "training-title-test": "Test the Network!",
  "training-label-training": "Training...",
  "training-adv-model-title": "Model architecture",
  "training-adv-model-dense": "3-Layer Dense Network",
  "training-adv-model-cnn": "Convolutional Network",
  "training-adv-model-nohidden": "No hidden layers",
  "training-adv-activation-title": "Activation function",
  "training-adv-activation-relu": "ReLU",
  "training-adv-activation-tanh": "tanh",
  "training-adv-activation-sigmoid": "sigmoid",
  "training-adv-learning-rate": "Learning rate",
  "training-adv-optimizer-title": "Optimizer",
  "training-adv-optimizer-adam": "Adam",
  "training-adv-optimizer-sgd": "Stochastic Gradient Descent",
  "training-label-images-used": "Images used",
  "training-label-predicted-accuracy": "Predicted Accuracy",
  "training-label-reset": "Reset training",
  "training-label-pause": "Pause/Resume training",
  "training-label-step": "Train a single step",
  "training-label-adv": "Modify the network",
  "training-label-adv-activate": "Activate Advanced Mode",
  "training-label-adv-cancel": "Cancel Advanced Mode",
  "how-work-title": "How does it work?",
  "how-work-learn-more": "Learn more",
  "how-work-learn-back": "Back",
  "how-work-what-is-nn-title": "What is a Neural Network?",
  "how-work-what-is-nn-teaser": "A Neural Network is a way to teach computer things.",
  "how-work-how-learn-title": "How Does the Network Learn?",
  "how-work-how-learn-teaser": "By trying to get an answer right again and again. Each time we say if the answer was correct.",
  "how-work-training-data-title": "What is Training Data?",
  "how-work-training-data-teaser": "The training data tells the network when it was right or wrong.",
  "how-learn-title": "How does the network learn?",
  "how-learn-text": "The neural networks learns by iteratively <b>adjusting its weights and biases</b>. For this, so called <b>Training Data</b>, is fed into the network. This is for example the picture of the number 8. Then the weights and biases of the network are adjusted, such that the output confidence of the number 8 is higher than the others. This adjustments are done gradually and depend on a learning rate. The default technique for this adjustment is called <b>Gradient Descent</b>. <i>(In Expert Mode you can choose different learning methods)</i>.",
  "what-is-nn-title": "What is a neural network?",
  "what-is-nn-text-1": "Neural networks are mathematical structures which are motivated by how our human brain works. They work with <b>input values</b>, a series of <b>artificial neurons</b> in one or more layers, and <b>output values</b>. Inside an individual computational neuron you can find weights and biases, which are numbers that can change, and functions like sums and the so called activation functions:",
  "what-is-nn-text-2": "In the case of this exhibit (Neural Numbers), we use an artificial network with 28 x 28 inputs, which are the colour pixel values for the input handwritten number, and one layer of 100 neurons. The output are 10 values, which are the confidence that the input matches one of the numbers from 0 to 9. The default activation function we use is the so called Rectified Linear Unit (ReLU): it just passes on the value of the input, if it is positive, and 0, if it is negative. <i>(In Expert Mode you can choose different activation functions)</i>.",
  "training-data-title": "What is Training Data?",
  "training-data-text-1": "Training data is the basis to make a neural network do what you desire. It is usually a large set of sample <b>inputs combined with the desired outputs</b>. Often a big part of the training data (for example 80%) is used to <b>train the network</b>, while the remaining part (for example 20%) is used to <b>test the network</b> and see its performance / accuracy. Training data is very valuable, and fortunately there are open databases like the <b>MNIST database</b> we used for this exhibit.",
  "training-data-text-2": "In the case of this exhibit (Neural Numbers), we have 70 000 images of handwritten numbers (input) and the number it depicts.",
  "training-data-text-3": "The training data is “unified or cleaned”, all pictures are 28 x 28 pixels and the image drawn is centered. Whenever you draw a number, your drawing will be transformed to such a sample image."
}
